{
    "id": "skymenu",
    "title": "SkyMenu",
    "title_ja": "SkyMenu",
    "year": "2025",
    "month": "2",
    "date": "2025-02-01",
    "category": "Web Development",
    "techStack": [
        "python",
        "gui",
        "pyautogui",
        "opencv-python"
    ],
    "description": "There is a service called SkyMenu in the information room. In this service, each student has an account, and by logging in to it, they can save the works in the class. However, many people leave the password of this account as the initial value (the same as the user ID), so this is a project to collect and enjoy it. Here you go. (※ Almost cracking, don't imitate)",
    "description_ja": "情報室のSkyMenuというサービスがあります。このサービスでは、生徒それぞれにアカウントが存在し、それにログインすることで、授業内での作品を保存することができます。しかし、このアカウントのパスワードを初期値のままにしておく（ユーザーIDと同じ）人が多いので、それを集計し、楽しむというものです。それではどうぞ。（※ほぼクラッキング、マネしないでね）",
    "details":[
        {
            "caption": "SkyMenu",
            "caption_ja": "SkyMenu",
            "content": ["SkyMenu is a web development project that allows users to create and manage their own menus."],
            "content_ja": ["SkyMenuは、ユーザーが自分のメニューを作成して管理できるウェブ開発プロジェクトです。"]
        },
        {
            "caption": "How to Crack",
            "caption_ja": "クラッキングのやり方",
            "content": [
                "There is a way to execute it with bat, but it couldn't be stopped, so here is a method using python which runs a bit slower but is still manageable.",
                "`py -m pip install pyautogui`",
                "Run this to install the necessary modules.",
                "Then, copy and execute this code.",
                "$[IDturtle.py](python)",
                "With this, you can crack the SkyMenu menu."
            ],
            "content_ja": [
                "batで実行する方法もありますが、止めれなくなってしまったので、やや実行の遅く、まだ手に負える範囲で暴走するpythonでのやり方を紹介します。",
                "`py -m pip install pyautogui`",
                "を実行して、必要なモジュールをインストールします。",
                "そして、このコードをコピーして実行。",
                "$[IDturtle.py](python)",
                "これで、SkyMenuのメニューをクラッキングすることができます。",
                "![画像1](/assets/skymenu/IMG_0514.jpeg)",
                "![画像2](/assets/skymenu/IMG_0515.jpeg)"
            ]
        },
        {
            "caption": "Mechanism",
            "caption_ja": "仕組み",
            "content": [
                "pyautogui takes a screenshot of the page, moves the mouse to a place where the image of the button taken in advance matches to some extent, and clicks it."
            ],
            "content_ja": [
                "pyautoguiで、ページのスクリーンショットを撮り、事前に撮っておいたボタンの画像とある程度適合するところにマウスを持っていき、クリックします。"
            ]
        }
    ]
}